#! /usr/bin/env python
# -*- coding: utf-8 -*-

#############################################################################
##
## Copyright (C) 2006-2012 Chuk&Gek and Vista Software. All rights reserved.
## Copyright (C) 2012-2017 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## 'M' запись протокола ASTM E-1394
##
#############################################################################

from Record import CRecord

class CManufacturerRecord(CRecord):
    structure = {
                    'recordType'            : ( 0,         str),
                    'seqNo'                 : ( 1,         int),
                    'errorCode'             : ( (2, 0, 0), unicode),
                    'alarmCode'             : ( (3, 0, 0), unicode),
                }
    recordType = 'M'
