# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2017-2018 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## "Handler" выполняющий цепочку других Handler-ов
##
#############################################################################

class CChainHandler(list):
    def sign(self, sw):
        for plugin in self:
            plugin.sign(sw)


    def verify(self, ps):
        for plugin in reversed(self):
            plugin.verify(ps)

