# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2016-2021 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## Настройки возможностей списка файлов
##
#############################################################################


class CAttachFilesTableFlag:
    canAdd        =   1
    canOpen       =   2
    canSave       =   4
    canRename     =   8
    canDelete     =  16

    canSignAsResp =  32
    canSignAsOrg  =  64

    canAnything   = 127
    canRead       =   6 #  canSave + canOpen

