# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2017-2021 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## Поддержка ККМ АТОЛ через ДТО.
## Похоже, что эти "добрые люди" удавили низкоуровневый протокол.
## И связь с ОФД сделали через свой драйвер.
## На странице https://interface31.ru/tech_it/2020/09/osobennosti-podklyucheniya-kkt-atol-na-platforme-5.html
## утвердается, что связь через EoU (ethernet over usb) всё ещё можно включить,
## Но не факт что при этом можно избежать использования ДТО :(((
##
#############################################################################