# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2017-2020 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## Сгенерированные ZSI объекты для работы с сервисом СФР
## Нам нужен ZSI определённой версии (см. ZSI-2.1-a1.tar.gz)
## команда для генерации:
##   wsdl2py -b ../wsdl/fixed/FileOperationsLnService.wsdl
## + ещё немного правок :(
## см. generate.sh
##
#############################################################################
