# -*- coding: utf-8 -*-
#############################################################################
##
## Copyright (C) 2019-2020 SAMSON Group. All rights reserved.
##
#############################################################################
##
## Это программа является свободным программным обеспечением.
## Вы можете использовать, распространять и/или модифицировать её согласно
## условиям GNU GPL версии 3 или любой более поздней версии.
##
#############################################################################
##
## Типа перечислимый тип "Протокол оборудования"
## При добавлении коды не ломаем, они хранятся в БД.
##
#############################################################################

# в БД rbEquipment.protocol
class CEquipmentProtocol:
    manual  = 0
    astm    = 1
    pacs    = 2
    fhir050 = 3
    fhir102 = 4
    samson  = 5

    mapProtocolToName = { manual:  u'Ручная методика',
                          astm:    u'Обмен файлами по ASTM E-1381 и E-1394',
                          pacs:    u'Pacs',
                          fhir050: u'FHIR 0.5.0 по предложению Нетрики (ОДЛИ)',
                          fhir102: u'FHIR 1.0.2 по предложению Нетрики (ОДЛИ)',
                          samson:  u'Самсон ЛИС',
                        }

    @classmethod
    def text(cls, protocol):
        if protocol in cls.mapProtocolToName:
            return cls.mapProtocolToName[protocol]
        else:
            return u'{%s}' % protocol

